//
//  DataStore.swift
//  ContactList
//
//  Created by Антон Баландин on 14.12.23.
//

class DataStore {
    let names: [String] = [ // явно определяю для избежания ошибки, если массив пустой
        "Антон",
        "Антон",
        "Кирилл",
        "Рустам",
        "Яромир",
        "Клавдий",
        "Лев",
        "Эмин",
        "Клим",
        "Савва",
        "Глеб",
        "Зиновий",
        "Вацлав",
        "Кузьма",
        "Виктор"
    ]
    
    let surnames: [String] = [
        "Соломахин",
        "Шулёв",
        "Луньков",
        "Новомейский",
        "Ижутин",
        "Косков",
        "Митасов",
        "Крутелев",
        "Эсаулов",
        "Кропанин",
    ]
    
    let telephones: [String] = [
        "3751202684805",
        "3759312531959",
        "3755850392695",
        "3755334874296",
        "3759545714244",
        "3753622185420",
        "3750491941591",
        "3750774296558",
        "3750634379839",
        "3754138805304",
        "3752737155880",
        "3758717141229",
        "3750063755483",
        "3750897760549",
        "3757113638645"
    ]
    
    let emails: [String] = [
        "o@outlook.com",
        "hr6zdl@yandex.ru",
        "kaft93x@outlook.com",
        "dcu@yandex.ru",
        "19dn@outlook.com",
        "pa5h@mail.ru",
        "281av0@gmail.com",
        "8edmfh@outlook.com",
        "sfn13i@mail.ru",
        "g0orc3x1@outlook.com",
        "rv7bp@gmail.com",
        "93@outlook.com",
        "er@gmail.com",
        "o0my@gmail.com",
        "715qy08@gmail.com",
    ]
}

